:PROPERTIES:
:ID:       6197ff71-afed-49c5-9796-8995cf7b66a7
:END:
#+TITLE: Moments of momentum
#+FILETAGS: :problem: :SPOP: :statmech:
#+SETUPFILE: ~/.config/emacs/setup/setupfile.org
#+BEGIN: clocktable :maxlevel 2 :scope nil :emphasize nil
#+CAPTION: Clock summary at [2024-04-26 Fri 23:25]
| Headline                 | Time   |
|--------------------------+--------|
| *Total time*             | *2:22* |
|--------------------------+--------|
| 3.12 Moments of momentum | 2:22   |
#+END
* 3.12 Moments of momentum
:LOGBOOK:
CLOCK: [2024-04-26 Fri 21:03]--[2024-04-26 Fri 23:25] =>  2:22
:END:

*Consider a gas of* \(N\) *classical particles of mass* \(m\) *in thermal equilibrium at a temperature* \(T\), *in a box of volume* \(V\).

Next: [[id:323e99f4-7b93-4150-a804-ee4741a65acd][Generalized ideal gas]]

** 3.12.1
*Write down the equilibrium one-particle density* \(f_{\text {eq. }}(\vec{p},\,\vec{q})\), *for coordinate* \(\vec{q}\), *and momentum* \(\vec{p}\).

The equilibrium [[id:261ca926-8250-4eaa-9974-ad0839ed3680][1-particle density]] \(f_{\text {eq.}} (\vec{p},\,\vec{q})\), for coordinate \(\vec{q}\), and momentum \(\vec{p}\) for a gas of* \(N\) classical particles of mass \(m\) in thermal equilibrium at a temperature \(T\), in a box of volume \(V\) is (see [[id:88fb08c6-3bc3-4d68-b620-8019b544946c][Particles in a box (classical)]])

\begin{align*}
f_{\text{eq.}} (\vec{p},\,\vec{q}) = n \bigg(\frac{\beta}{2 \pi m}\bigg)^{3 / 2} \exp \bigg(-\frac{\beta(\vec{p}-\vec{p}_0)^2}{2 m}\bigg),
\end{align*}

** 3.12.2
*Calculate the joint characteristic function,* \(\langle\exp (-\mathrm{i} \vec{k} \cdot \vec{p})\rangle\), *for momentum.*

Marginalizing over \( \vec{q} \), we are left with (see also the problem [[id:df72e834-3e97-490b-93b6-bcbc6d85e4c0][Effusion]])

\begin{align*}
f_{\text{eq.}} (\vec{p}) = N \bigg(\frac{\beta}{2 \pi m}\bigg)^{3 / 2} \exp \bigg(-\frac{\beta(\vec{p}-\vec{p}_0)^2}{2 m}\bigg).
\end{align*}

We then use \( f_{1} = N \rho_1 \) (see [[id:261ca926-8250-4eaa-9974-ad0839ed3680][s-particle density]]) to obtain the marginal of the [[id:21d62749-69ab-4e25-b366-eb6ff17a2f09][phase space density]]

\begin{align*}
\rho_{\text{eq.}} (\vec{p}) = \bigg(\frac{\beta}{2 \pi m}\bigg)^{3 / 2} \exp \bigg(-\frac{\beta(\vec{p}-\vec{p}_0)^2}{2 m}\bigg).
\end{align*}

Its joint characteristic function, by definition is

\begin{align*}
\tilde{\rho}_{\text{eq.}}(\vec{k}) &\equiv \langle \exp (-i \vec{k} \cdot \vec{p}) \rangle = \int \mathrm{d}^3 \vec{p}\, \bigg(\frac{\beta}{2 \pi m}\bigg)^{3 / 2} \exp \bigg(- \frac{\beta (\vec{p} - \vec{p}_0)^2}{2 m} - i \, \vec{k} \cdot \vec{p} \bigg) \\
\end{align*}

The transformation \( \vec{p} - \vec{p}_0 \to \vec{p}^{\thinspace \prime}\) (with unit [[id:dad8b579-a898-43e8-a65c-78b8848b00fa][Jacobian]]) yields

\begin{align*}
\tilde{\rho}_{\text{eq.}}(\vec{k}) &= \int \mathrm{d}^3 \vec{p}^{\thinspace \prime}\, \bigg(\frac{\beta}{2 \pi m}\bigg)^{3 / 2} \exp \bigg(- \beta \frac{\vec{p}^{\thinspace \prime} \cdot \vec{p}^{\thinspace \prime}}{2 m} - i \, \vec{k} \cdot \big[\vec{p}^{\thinspace \prime} + \vec{p}_0\big] \bigg) \\
&= \exp \big(- i \, \vec{k} \, \vec{p}_0 \big) \int \mathrm{d}^3 \vec{p}^{\thinspace \prime}\, \bigg(\frac{\beta}{2 \pi m}\bigg)^{3 / 2} \exp \bigg(- \beta \frac{\vec{p}^{\thinspace \prime} \cdot \vec{p}^{\thinspace \prime}}{2 m} - i \, \vec{k} \cdot \vec{p}^{\thinspace \prime} \bigg) \\
\end{align*}

Using standard [[id:708e32d3-4489-46b7-b35d-ce8cc91c0d82][Gaussian integral]] results

\begin{equation*}
\tilde{\rho}_{\text{eq.}}(\vec{k})  & =\exp \bigg( - i \, \vec{k} \cdot \vec{p}_0 -\frac{m \vec{k} \cdot \vec{k}}{2 \beta} \bigg)
\end{equation*}

** 3.12.3
*Find all the joint cumulants* \(\left\langle p_{x}^{\ell} p_{y}^{m} p_{z}^{n}\right\rangle_{c}\).

The joint cumulants \(\langle p_x^l p_y^m p_z^n\rangle_c\) are generated by the cumulant generating function which, by definition, is the logarithm of the characteristic function. So we have

\begin{align*}
\langle p_x^l \, p_y^m \, p_z^n\rangle_c &= \big[\partial_{-i k_x}^{\thinspace l} \, \partial_{-i k_y}^{\thinspace m} \, \partial_{-i k_z}^{\thinspace n} \big] \ln \tilde{\rho}_{\text{eq.}} \, (\vec{k}) \vert_{\vec{k}=0} \\
&= \big[\partial_{-i k_x}^{\thinspace l} \, \partial_{-i k_y}^{\thinspace m} \, \partial_{-i k_z}^{\thinspace n} \big] \bigg(- i\, \big[k_x \cdot p_{0,\,x} + k_y \cdot p_{0,\,y} + k_z \cdot p_{0,\,z} \big] - (m/2 \beta) \big[k_x^2 + k_y^2 + k_z^2 \big] \bigg) \bigg \vert_{\vec{k} = 0} \\
&= p_{0,\,x} \, \delta_{l1}\, \delta_{m0}\,\delta_{n0} + p_{0,\,y} \, \delta_{l0}\, \delta_{m1}\,\delta_{n0} + p_{0,\,z} \, \delta_{l0}\, \delta_{m0}\,\delta_{n1} + (m / \beta) \big[\delta_{l2}\,\delta_{m0},\delta_{n0} + \delta_{l0}\,\delta_{m2},\delta_{n0} + \delta_{l0}\,\delta_{m0},\delta_{n2} \big]
\end{align*}

** 3.12.4
*Calculate the joint moment* \(\langle p_{\alpha} \, p_{\beta} \, (\vec{p} \cdot \vec{p})\rangle\).

Using [[id:0b9d22e8-6701-4afd-bc64-5c41e491822e][Wick's theorem]] we have

\begin{align*}
\langle p_\alpha p_\beta \, (\vec{p} \cdot \vec{p}) \rangle &= \langle p_\alpha \, p_\beta \, p_\gamma \, p_\gamma \rangle \\
&= \langle p_\alpha \, p_\beta \rangle \langle p_\gamma \, p_\gamma \rangle + 2 \langle p_\alpha \, p_\gamma \rangle \langle p_\beta \, p_\gamma \rangle \\
&= (m k_B T)^2 \delta_{\alpha \beta} \, \delta_{\gamma \gamma} + 2 (m k_B T)^2 \delta_{\alpha \gamma} \, \delta_{\beta \gamma} \\
& =5(m k_B T)^2 \delta_{\alpha \beta} .
\end{align*}